Repository: szeder/all-git-forks
Catalog: po/*.po
Languages: is

source: Could not make %s writable by group
is: Gat ekki gert %s skrifanlega af hóp

source: insanely long template name %s
is: brjálæðislega langt sniðsnafn %s

source: cannot stat '%s'
is: gat ekki stat-að '%s'

source: cannot stat template '%s'
is: gat ekki stat-að sniðið '%s'

source: cannot opendir '%s'
is: gat ekki opnað möppuna '%s'

source: cannot readlink '%s'
is: gat ekki lesið tengilinn '%s'

source: insanely long symlink %s
is: brjálæðislega langur tengill %s

source: cannot symlink '%s' '%s'
is: gat ekki búið til tengilinn '%s' '%s'

source: cannot copy '%s' to '%s'
is: gat ekki afritað '%s' til '%s'

source: ignoring template %s
is: hunsa sniðið %s

source: insanely long template path %s
is: brjálæðislega löng slóð á snið %s

source: templates not found %s
is: sniðin funndust ekki %s

source: not copying templates of a wrong format version %d from '%s'
is: afrita ekki sniðin vegna rangar útgáfu %d frá '%s'

source: insane git directory %s
is: brjáluð git mappa %s

source: %s%s Git repository in %s%s
is: %s%s Git lind í %s%s

source: Reinitialized existing
is: Endurgerði

source: Initialized empty
is: Bjó til tóma

source: shared
is: sameiginlega

source: cannot tell cwd
is: finn ekki núverandi möppu

source: cannot mkdir %s
is: get ekki búið til möppuna %s

source: cannot chdir to %s
is: get ekki farið inn í möppuna %s

source: %s (or --work-tree=<directory>) not allowed without specifying %s (or --git-dir=<directory>)
is: %s (eða --work-tree=<mappa>) ekki leyfilegt ásamt %s (eða --git-dir=<mappa>)

source: Cannot access current working directory
is: Get ekki opnað núverandi möppu

source: Cannot access work tree '%s'
is: Get ekki opnað tréð '%s'

source: See 'git help COMMAND' for more information on a specific command.
is: Sjá 'git help SKIPUN' til að sjá hjálp fyrir tiltekna skipun.

source: TEST: A C test string
is: TILRAUN: C tilraunastrengur

source: TEST: A C test string %s
is: TILRAUN: C tilraunastrengur %s

source: TEST: Hello World!
is: TILRAUN: Halló Heimur!

source: TEST: Old English Runes
is: TILRAUN: ᚻᛖ ᚳᚹᚫᚦ ᚦᚫᛏ ᚻᛖ ᛒᚢᛞᛖ ᚩᚾ ᚦᚫᛗ ᛚᚪᚾᛞᛖ ᚾᚩᚱᚦᚹᛖᚪᚱᛞᚢᛗ ᚹᛁᚦ ᚦᚪ ᚹᛖᛥᚫ

source: TEST: ‘single’ and “double” quotes
is: TILRAUN: ‚einfaldar‘ og „tvöfaldar“ gæsalappir

source: TEST: A Shell test string
is: TILRAUN: Skeljartilraunastrengur

source: TEST: A Shell test $variable
is: TILRAUN: Skeljartilraunastrengur með breytunni $variable

source: TEST: A Perl test string
is: TILRAUN: Perl tilraunastrengur

source: TEST: A Perl test variable %s
is: TILRAUN: Perl tilraunastrengur með breytunni %s
